<?xml version="1.0" ?>
<net name="0311_416" version="10">
	<layers>
		<layer id="0" name="images" type="Parameter" version="opset1">
			<data shape="1, 3, 416, 416" element_type="f16"/>
			<output>
				<port id="0" precision="FP16" names="images">
					<dim>1</dim>
					<dim>3</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Slice_4/Concat1052241199" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="0" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Slice_4/Concat105061052341709" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="32" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Slice_4/Strides1052441628" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="64" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Slice_4" type="StridedSlice" version="opset1">
			<data begin_mask="1, 1, 0, 1" end_mask="1, 1, 0, 1" new_axis_mask="0, 0, 0, 0" shrink_axis_mask="0, 0, 0, 0" ellipsis_mask="0, 0, 0, 0"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP16" names="659">
					<dim>1</dim>
					<dim>3</dim>
					<dim>208</dim>
					<dim>416</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Slice_9/Concat1057042006" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="0" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Slice_9/Concat105541057142051" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="96" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Slice_9/Strides1057242072" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="128" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Slice_9" type="StridedSlice" version="opset1">
			<data begin_mask="1, 1, 1, 0" end_mask="1, 1, 1, 0" new_axis_mask="0, 0, 0, 0" shrink_axis_mask="0, 0, 0, 0" ellipsis_mask="0, 0, 0, 0"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>208</dim>
					<dim>416</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP16" names="664">
					<dim>1</dim>
					<dim>3</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Slice_24/Concat1071441934" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="160" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Slice_24/Concat106981071542138" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="32" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Slice_24/Strides1071641841" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="64" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Slice_24" type="StridedSlice" version="opset1">
			<data begin_mask="1, 1, 0, 1" end_mask="1, 1, 0, 1" new_axis_mask="0, 0, 0, 0" shrink_axis_mask="0, 0, 0, 0" ellipsis_mask="0, 0, 0, 0"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP16" names="679">
					<dim>1</dim>
					<dim>3</dim>
					<dim>208</dim>
					<dim>416</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Slice_29/Concat1076241262" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="0" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Slice_29/Concat107461076341298" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="96" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Slice_29/Strides1076441820" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="128" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Slice_29" type="StridedSlice" version="opset1">
			<data begin_mask="1, 1, 1, 0" end_mask="1, 1, 1, 0" new_axis_mask="0, 0, 0, 0" shrink_axis_mask="0, 0, 0, 0" ellipsis_mask="0, 0, 0, 0"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>208</dim>
					<dim>416</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP16" names="684">
					<dim>1</dim>
					<dim>3</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Slice_14/Concat1061842336" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="0" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Slice_14/Concat106021061941958" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="32" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Slice_14/Strides1062042081" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="64" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Slice_14" type="StridedSlice" version="opset1">
			<data begin_mask="1, 1, 0, 1" end_mask="1, 1, 0, 1" new_axis_mask="0, 0, 0, 0" shrink_axis_mask="0, 0, 0, 0" ellipsis_mask="0, 0, 0, 0"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP16" names="669">
					<dim>1</dim>
					<dim>3</dim>
					<dim>208</dim>
					<dim>416</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Slice_19/Concat1066641247" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="192" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Slice_19/Concat106501066742348" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="96" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Slice_19/Strides1066841703" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="128" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Slice_19" type="StridedSlice" version="opset1">
			<data begin_mask="1, 1, 1, 0" end_mask="1, 1, 1, 0" new_axis_mask="0, 0, 0, 0" shrink_axis_mask="0, 0, 0, 0" ellipsis_mask="0, 0, 0, 0"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>208</dim>
					<dim>416</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP16" names="674">
					<dim>1</dim>
					<dim>3</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Slice_34/Concat1081041250" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="160" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Slice_34/Concat107941081141472" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="32" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Slice_34/Strides1081242111" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="64" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Slice_34" type="StridedSlice" version="opset1">
			<data begin_mask="1, 1, 0, 1" end_mask="1, 1, 0, 1" new_axis_mask="0, 0, 0, 0" shrink_axis_mask="0, 0, 0, 0" ellipsis_mask="0, 0, 0, 0"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP16" names="689">
					<dim>1</dim>
					<dim>3</dim>
					<dim>208</dim>
					<dim>416</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Slice_39/Concat1085842408" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="192" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Slice_39/Concat108421085941814" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="96" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Slice_39/Strides1086041424" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="128" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Slice_39" type="StridedSlice" version="opset1">
			<data begin_mask="1, 1, 1, 0" end_mask="1, 1, 1, 0" new_axis_mask="0, 0, 0, 0" shrink_axis_mask="0, 0, 0, 0" ellipsis_mask="0, 0, 0, 0"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>208</dim>
					<dim>416</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP16" names="694">
					<dim>1</dim>
					<dim>3</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Concat_40" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP16" names="695">
					<dim>1</dim>
					<dim>12</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="1582" type="Const" version="opset1">
			<data element_type="f16" shape="12, 1, 1, 3, 3" offset="224" size="216"/>
			<output>
				<port id="0" precision="FP16" names="1582">
					<dim>12</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Conv_41/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>12</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>12</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>12</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Conv_41/Dims9285" type="Const" version="opset1">
			<data element_type="f16" shape="1, 12, 1, 1" offset="440" size="24"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>12</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Conv_41" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>12</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>12</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="1581">
					<dim>1</dim>
					<dim>12</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="1585" type="Const" version="opset1">
			<data element_type="f16" shape="16, 12, 1, 1" offset="464" size="384"/>
			<output>
				<port id="0" precision="FP16" names="1585">
					<dim>16</dim>
					<dim>12</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Conv_42/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>12</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>12</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Conv_42/Dims9891" type="Const" version="opset1">
			<data element_type="f16" shape="1, 16, 1, 1" offset="848" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Conv_42" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="1584">
					<dim>1</dim>
					<dim>16</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="70042447" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1, 1" offset="880" size="2"/>
			<output>
				<port id="0" precision="FP16" names="700">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Add_44" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="701">
					<dim>1</dim>
					<dim>16</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Clip_47" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="704">
					<dim>1</dim>
					<dim>16</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="70341373" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1, 1" offset="882" size="2"/>
			<output>
				<port id="0" precision="FP16" names="703">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Div_49" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="706">
					<dim>1</dim>
					<dim>16</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Mul_50" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="707">
					<dim>1</dim>
					<dim>16</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="1588" type="Const" version="opset1">
			<data element_type="f16" shape="16, 1, 1, 3, 3" offset="884" size="288"/>
			<output>
				<port id="0" precision="FP16" names="1588">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Conv_51/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Conv_51/Dims9375" type="Const" version="opset1">
			<data element_type="f16" shape="1, 16, 1, 1" offset="1172" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Conv_51" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="1587">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="1591" type="Const" version="opset1">
			<data element_type="f16" shape="32, 16, 1, 1" offset="1204" size="1024"/>
			<output>
				<port id="0" precision="FP16" names="1591">
					<dim>32</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Conv_52/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Conv_52/Dims9681" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="2228" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Conv_52" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="1590">
					<dim>1</dim>
					<dim>32</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="70042246" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1, 1" offset="880" size="2"/>
			<output>
				<port id="0" precision="FP16" names="700">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Add_54" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="713">
					<dim>1</dim>
					<dim>32</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Clip_57" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="716">
					<dim>1</dim>
					<dim>32</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="70341739" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1, 1" offset="882" size="2"/>
			<output>
				<port id="0" precision="FP16" names="703">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Div_59" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="718">
					<dim>1</dim>
					<dim>32</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Mul_60" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="719">
					<dim>1</dim>
					<dim>32</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="1594" type="Const" version="opset1">
			<data element_type="f16" shape="16, 32, 1, 1" offset="2292" size="1024"/>
			<output>
				<port id="0" precision="FP16" names="1594">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Conv_61/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Conv_61/Dims9807" type="Const" version="opset1">
			<data element_type="f16" shape="1, 16, 1, 1" offset="3316" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Conv_61" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="1593">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="70041811" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1, 1" offset="880" size="2"/>
			<output>
				<port id="0" precision="FP16" names="700">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Add_63" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="723">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Clip_66" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="726">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="70341865" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1, 1" offset="882" size="2"/>
			<output>
				<port id="0" precision="FP16" names="703">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Div_68" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="728">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Mul_69" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="729">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="1600" type="Const" version="opset1">
			<data element_type="f16" shape="16, 16, 1, 1" offset="3348" size="512"/>
			<output>
				<port id="0" precision="FP16" names="1600">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Conv_79/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Conv_79/Dims9453" type="Const" version="opset1">
			<data element_type="f16" shape="1, 16, 1, 1" offset="3860" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Conv_79" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="1599">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="700" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1, 1" offset="880" size="2"/>
			<output>
				<port id="0" precision="FP16" names="700">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Add_81" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="743">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Clip_84" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="746">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="70341940" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1, 1" offset="882" size="2"/>
			<output>
				<port id="0" precision="FP16" names="703">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Div_86" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="748">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Mul_87" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="749">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="1603" type="Const" version="opset1">
			<data element_type="f16" shape="16, 1, 1, 3, 3" offset="3892" size="288"/>
			<output>
				<port id="0" precision="FP16" names="1603">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Conv_88/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Conv_88/Dims9651" type="Const" version="opset1">
			<data element_type="f16" shape="1, 16, 1, 1" offset="4180" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Conv_88" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="1602">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="1606" type="Const" version="opset1">
			<data element_type="f16" shape="16, 16, 1, 1" offset="4212" size="512"/>
			<output>
				<port id="0" precision="FP16" names="1606">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Conv_89/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Conv_89/Dims9573" type="Const" version="opset1">
			<data element_type="f16" shape="1, 16, 1, 1" offset="4724" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Conv_89" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="1605">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="70042243" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1, 1" offset="880" size="2"/>
			<output>
				<port id="0" precision="FP16" names="700">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Add_91" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="755">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Clip_94" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="758">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="70341451" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1, 1" offset="882" size="2"/>
			<output>
				<port id="0" precision="FP16" names="703">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Div_96" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="760">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Mul_97" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="761">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Add_98" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="762">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="1597" type="Const" version="opset1">
			<data element_type="f16" shape="16, 32, 1, 1" offset="4756" size="1024"/>
			<output>
				<port id="0" precision="FP16" names="1597">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Conv_70/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Conv_70/Dims9549" type="Const" version="opset1">
			<data element_type="f16" shape="1, 16, 1, 1" offset="5780" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Conv_70" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="1596">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="70041490" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1, 1" offset="880" size="2"/>
			<output>
				<port id="0" precision="FP16" names="700">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Add_72" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="733">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Clip_75" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="736">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="70341916" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1, 1" offset="882" size="2"/>
			<output>
				<port id="0" precision="FP16" names="703">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Div_77" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="738">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Mul_78" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="739">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="Concat_99" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="763">
					<dim>1</dim>
					<dim>32</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="1609" type="Const" version="opset1">
			<data element_type="f16" shape="32, 32, 1, 1" offset="5812" size="2048"/>
			<output>
				<port id="0" precision="FP16" names="1609">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Conv_100/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Conv_100/Dims9747" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="7860" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Conv_100" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="1608">
					<dim>1</dim>
					<dim>32</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="70041397" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1, 1" offset="880" size="2"/>
			<output>
				<port id="0" precision="FP16" names="700">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Add_102" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="767">
					<dim>1</dim>
					<dim>32</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="Clip_105" type="Clamp" version="opset1">
			<data min="0" max="6"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="770">
					<dim>1</dim>
					<dim>32</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="70342183" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1, 1" offset="882" size="2"/>
			<output>
				<port id="0" precision="FP16" names="703">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="Div_107" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="772">
					<dim>1</dim>
					<dim>32</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="Mul_108" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="773">
					<dim>1</dim>
					<dim>32</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="1612" type="Const" version="opset1">
			<data element_type="f16" shape="32, 1, 1, 3, 3" offset="7924" size="576"/>
